framing.tex
% Created 2017-03-01 Wed 21:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Tristan Strange}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Tristan Strange},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{FACE or ACE?}
\label{sec:org6d02e6a}

\subsection{Abstract}
\label{sec:org2d8f6a4}
\subsection{Introduction}
\label{sec:org59af306}

Computational processes are only useful when we are able to communicate with it in order to assign it tasks, and understand the information it returns.

Recent measures for computational creativity have such as FACE have looked to reward systems that can frame there output.

Colton et al. have claimed in a number of papers that in order for a systems to be "taken seriously as creative entities in the cultural world" they should be to be fitted with a "story generator" which produces not only framing information but that can be drawn in to a dialogue in which it will answer any questions asked of it \cite{colton-goodwin-veale:2012} \cite{AlisonPeaseandSimonColton2011}. 

In fact the field of AI in general and regularly with in CC there have been calls for systems to be enabled with the ability to converse using natural language \cite{Baroni2017} 

Veale?

\subsection{Is framing info good}
\label{sec:orgeb819ad}

Whilst framing information can add value to creative acts, allowing agents unfamiliar with a medium, practice piece, or computing concepts such as programming or computational creativity evaluation to situate pieces it produces along side others it knows about.

Monalisa - is she similing or not? 
Much of the value considered in the idea image is open to interpretation. Artists did not provide one for us.

Vasari - the original art critic observed that jesters and musicians were employed to entertain
Freud's interpretation that image reflects Leonardo's memory of his mother \cite{Barolsky1991}

Other argue that she's simply hiding her front teeth \cite{Borkowski1992}

Indeed this ambiguity still drives scientific research in to the perception of smiling today.

Had Leonardo provided an explanation of what exactly she's doing it's questionable whether this work would be the focus of such discussions today \cite{Kontsevich2004}.

\subsection{Accessability of language}
\label{sec:orgd5fc2dd}

A language only reveals the meaning within its utterances to those with some fluency in it. 
The framing information required of arts students is often inaccessible to those with out arts degrees.
If framing information is in French it is inaccessible to English speaker.
Many acts of genius are limited to understanding by peers.
Certain mental disorders negate access to body or spoken language.
Disabled children - Guild Hall museum - Blind people

\subsection{Do we have enough already?}
\label{sec:org200c174}
\subsubsection{What framing info do we get for cheap}
\label{sec:org5dbc7d9}
\begin{enumerate}
\item Understanding what a program has done
\label{sec:org8ee5233}
\begin{enumerate}
\item Explaining processes with code
\label{sec:org1f2a280}
\begin{enumerate}
\item code self documenting
\label{sec:org137b273}
\begin{enumerate}
\item Human readability
\label{sec:org78f5a75}
How far have we really come with regards to human readability?
Relatively recent innovations such as HTML, XML Schema 
seem to have been distracted from the original goal of making data more portable
More important that we produce measurable artefacts that easily translate in to measurable artefacts for our bosses - jar file - check!, schema check!
In some way much of the current state of the art in these areas has begun to look back toward what we had back in the fifties - a totally uniform means of expressing the shape of data 
(EDN <- LISP, JSON <spec <- Regular expressions) 

\item Knuth - Literate programming
\label{sec:orgdc45864}
Knuth argued that programs should be considered works of literature and that there purpose should not just be to instruct a machine on how to operate but also explain to human beings what we want a computer to do.

Whilst he focused on improving comprehensibility through the incorporation of natural language in to program descriptions with his WEB system

\cite{Knuth}
\item Dijkstra - structured programming
\label{sec:orgbf4c5bf}
\cite{Dijkstra} noted in the seventies that the conceptual gap between the static program and the corresponding computations

The von Neuman architecture only allows the execution of a single change in state at a time and all computations can be viewed as the sequential completion of simpler steps.

Even tools like flow charts can be used to comprehensibly describe a system
\end{enumerate}
\end{enumerate}

\item DSL
\label{sec:org4368f44}

\item Logging
\label{sec:orgb3bd5ec}
\begin{enumerate}
\item Unexplaiable neural networks
\label{sec:orgfe166d0}
\begin{enumerate}
\item Deep dream - it's hard to tell what each layer is responsible for
\label{sec:orgb411717}
\item when layers are visualised - meaning is clearer
\label{sec:orge0b4d90}
\end{enumerate}

\item Self explaining evolutionary histories
\label{sec:org1518ab4}
\end{enumerate}
\end{enumerate}

\item Conversing with computers with code
\label{sec:org086a190}
\begin{enumerate}
\item Interaction fulfilled by REPL
\label{sec:org24c8cae}

We need to get in to a dialogue

The closest we've come to conversing in an interactive manner with a machine could be said to be working with a machine at the REPL.
Quick feedback. 
Machine and user in tight feedback loop. 
Talking in the same language.
Probe
Turing tests
\end{enumerate}
\end{enumerate}


\subsection{Source code vs thought experiments}
\label{sec:org5868386}
Possibility of deeper interaction with code than with people.
Thought experiments can be replicated.
In English language there is room for ambiguity, misinterpretation and loss of meaning and different interpretations from different people.
Code is an expression in languages that can not be misinterpreted. the system always does what you said.

Randomness

\subsection{lieing/honesty window dressing}
\label{sec:org7359448}

Live coding 
\begin{itemize}
\item Framing info shown
\begin{itemize}
\item Confuse audience in to believing that something clever has happened.
\end{itemize}
\end{itemize}

Magic tricks  

Distracts from the creative act

\subsection{New forms of intelligence/creativity}
\label{sec:orgeeff98e}
Regularily claimed that intelligence/creativity are not human only phenoma
Expecting non-human to use human specific language seems silly.

\subsection{autonomy vs framing information}
\label{sec:org6df2e97}
Colton claims more.

\subsubsection{Hiding finger prints is the opposite of framing}
\label{sec:org31a6bea}
\cite{Ventura2016} argues that as we move towards systems that can autonomously creative systems should aim to hide the finger prints of there creators believing that a process of 'Inception' may be used to inject greater nuance and depth in to a generalised process.

Keith Row - revealing (or lack of) process

\subsection{Random notes}
\label{sec:org36a3be5}

Harry Frankfurt - on bullshit
George Lewis - multi-domincance in systems

ML is obsessed with multiple examples
Generalise from one example
\begin{itemize}
\item Use knowledge of space around implementation
\item Repurpose
\end{itemize}

Play first/learning later

Antrhropamorphise

We can ask artists to contextualise

Epistomology
Justified 
\begin{itemize}
\item protect
\item post structuralist
\item Questioning from Turing
\begin{itemize}
\item open to be asked questions
\end{itemize}

\item Painting fool
\end{itemize}
dishonesty
window dressing

Air traffic communications

\subsection{Shifting goal posts}
\label{sec:orge1012ef}

\subsubsection{AI}
\label{sec:org31376c0}
Chess not good enough
Driving not good enough
Tacit knowledge

Searle objection - Chinese box
Minds, brains and programs
\begin{itemize}
\item System can speak english
\end{itemize}

\subsubsection{Arty farty}
\label{sec:orgd72c760}

Labour
Frame work in same means as working class

Success measured in the galleries

Death of the author
Framing is done viewer - Roland Barthes. Interpretation
Pierre Bordieux - technocrat

Why do we need to placate the art critics?

It's arguable whether existing in artists in a particular domain do have a stake in deciding whether or not software can be creative.

We seem to borrow much from post-modernists cannons on interpretation of art work.

It seems we have not yet fully understood the post-modern doctrine.

We understand that an artist will rebel against aesthetic constraints \cite{colton:2008a} but seem to have misunderstood whats been said about interpretation

Whilst the issue of \textbf{latent heat} persists "We can only quarrel with one or another means of defense. Indeed, we have an obligation to overthrow any means of defending and justifying art which becomes particularly obtuse or onerous or insensitive to contemporary needs and practice." 
\cite{Sontag1966}

\subsection{Discussion}
\label{sec:orgcc09bcc}
\subsection{are we modelling more than we need to?}
\label{sec:org8bacc2f}

To what extent should we be imitating artists/scientists?

\subsubsection{DIFI?}
\label{sec:orgc626e15}
People interpret work in contexts
Can't be controlled
preconceptions
read FRAME and re-frame anyway

Swap art crtitic for Press/audience/

Is the F suitable for all types of C?
F is just an E

interaction vs framing vs promotion
professional and ameteuer

\subsubsection{everyday creativity}
\label{sec:org67fee6f}

creative promoter
doodlers/sat in bedrooms

\subsection{Recommendations}
\label{sec:org0a1ca89}
\subsubsection{reproducible}
\label{sec:org6f752f2}
\subsubsection{Open source}
\label{sec:org22d6eb1}
\subsubsection{Well documented}
\label{sec:orgc8b3dea}
\subsubsection{High level}
\label{sec:orge77887e}
\subsubsection{Specifications}
\label{sec:org194123c}
\subsubsection{Providing services}
\label{sec:org02fd3fc}

\subsection{Conclusion}
\label{sec:org797f983}
framing info can be a distraction

within our research outputs there's a great many sources of framing info

IT"S MY BELIEF THAT FRAMING INFORMATION SHOULD NOT BE USED TO INDICATE HOW CREATIVE A SYSTEM IS BEING UNLESS SAID FRAMING INFORMATION IS CREATED CREATIVELY

Whilst involving as many participants is extremely important we should feel free to develop systems that aren't concerned with the perception of others 

historical web art
\end{document}
